EDT/УТ/src/InformationRegisters/ДополнительныеПараметрыФизЛиц/ДополнительныеПараметрыФизЛиц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДополнительныеПараметрыФизЛиц</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ОсновнаяРольСотрудника</name>
    <type>
      <types>CatalogRef.РолиСотрудников</types>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументРегистратор</name>
    <type>
      <types>DocumentRef.КадровоеПеремещениеРаботниковОрганизаций</types>
      <types>DocumentRef.ПриемНаРаботуВОрганизацию</types>
    </type>
  </attributes>
  <dimensions>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/InformationRegisters/ДополнительныеПараметрыФизЛиц/ManagerModule.bsl
Функция ИнициализироватьДополнительныеПараметры(ФизЛицо) Экспорт
	
	СтруктураПараметров = Новый Структура();
	
	Для каждого Поле Из Метаданные.РегистрыСведений.ДополнительныеПараметрыФизЛиц.Измерения Цикл
		СтруктураПараметров.Вставить(Поле.Имя);
	КонецЦикла; 
	
	Для каждого Поле Из Метаданные.РегистрыСведений.ДополнительныеПараметрыФизЛиц.Ресурсы Цикл
		СтруктураПараметров.Вставить(Поле.Имя);
	КонецЦикла; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДополнительныеПараметрыФизЛицСрезПоследних.ФизЛицо КАК ФизЛицо,
		|	ДополнительныеПараметрыФизЛицСрезПоследних.ОсновнаяРольСотрудника КАК ОсновнаяРольСотрудника
		|ИЗ
		|	РегистрСведений.ДополнительныеПараметрыФизЛиц.СрезПоследних(, ФизЛицо = &ФизЛицо) КАК ДополнительныеПараметрыФизЛицСрезПоследних";
	
	Запрос.УстановитьПараметр("ФизЛицо", ФизЛицо);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(СтруктураПараметров, ВыборкаДетальныеЗаписи);
	КонецЦикла;
		
	Возврат СтруктураПараметров;
	
КонецФункции // ()
 
Процедура ДобавлениеИзменениеПараметровФизЛица(ФизЛицо, ОсновнаяРоль) Экспорт

	Набор = РегистрыСведений.ДополнительныеПараметрыФизЛиц.СоздатьНаборЗаписей();
	Набор.Отбор.ФизЛицо.Установить(ФизЛицо);

	Набор.Прочитать();
	
	Запись							= Набор.Добавить();
	Запись.Период					= ТекущаяДата();
	Запись.ФизЛицо					= ФизЛицо;
	Запись.ОсновнаяРольСотрудника	= ОсновнаяРоль;
	Запись.Пользователь				= ПараметрыСеанса.ТекущийПользователь;
	
	Набор.Записать();
	
КонецПроцедуры
